# Chap 05

## 5.1 pandas 자료구조 소개

### 5.1.1 Series

In [2]:
from pandas import Series, DataFrame

In [3]:
import pandas as pd

In [4]:
obj = Series([4,7,-5,3])

In [5]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [7]:
obj.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [8]:
obj2 = Series([4,7,-5,3], index=['d','b','a','c'])

In [9]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [10]:
obj2['a']

-5

In [11]:
obj[['c','a','d']]

c   NaN
a   NaN
d   NaN
dtype: float64

In [12]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [13]:
obj2[obj2>0]

d    4
b    7
c    3
dtype: int64

In [14]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [15]:
import numpy as np
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [16]:
'b' in obj2

True

In [17]:
'e' in obj2

False

In [18]:
sdata = {'Ohio':30555,'Texas':71000,'Oregon':16000,'Utah':5000}

In [19]:
obj3=Series(sdata)

In [20]:
obj3

Ohio      30555
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [21]:
states=['California','Ohio','Oregon','Texas']

In [22]:
obj4=Series(sdata,index=states)

In [23]:
obj4

California      NaN
Ohio          30555
Oregon        16000
Texas         71000
dtype: float64

In [24]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [25]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [26]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [27]:
obj3

Ohio      30555
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [28]:
obj4

California      NaN
Ohio          30555
Oregon        16000
Texas         71000
dtype: float64

In [29]:
obj3 + obj4

California       NaN
Ohio           61110
Oregon         32000
Texas         142000
Utah             NaN
dtype: float64

In [30]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California      NaN
Ohio          30555
Oregon        16000
Texas         71000
Name: population, dtype: float64

In [31]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [32]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### 5.1.2 DataFrame

In [33]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [34]:
frame = DataFrame(data)

In [35]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [36]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [37]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'], index=['one', 'two', 'three', 'four', 'five'])

In [38]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [39]:
frame2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

In [40]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [41]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [42]:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [43]:
frame2.ix['three']   #index가 three

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [44]:
frame2['debt'] = 16.5

In [45]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [46]:
frame2['debt']=np.arange(5.)

In [47]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

In [48]:
val=Series([-1.2,-1.5,-1.7],index=['two','four','five'])

In [49]:
frame2['dept'] = val

In [50]:
frame2

       year   state  pop  debt  dept
one    2000    Ohio  1.5     0   NaN
two    2001    Ohio  1.7     1  -1.2
three  2002    Ohio  3.6     2   NaN
four   2001  Nevada  2.4     3  -1.5
five   2002  Nevada  2.9     4  -1.7

In [51]:
frame2['eastern'] = frame2.state == 'Ohio'

In [52]:
frame2

       year   state  pop  debt  dept eastern
one    2000    Ohio  1.5     0   NaN    True
two    2001    Ohio  1.7     1  -1.2    True
three  2002    Ohio  3.6     2   NaN    True
four   2001  Nevada  2.4     3  -1.5   False
five   2002  Nevada  2.9     4  -1.7   False

In [53]:
del frame2['eastern']

In [54]:
frame2.columns

Index([u'year', u'state', u'pop', u'debt', u'dept'], dtype='object')

In [55]:
frame2

       year   state  pop  debt  dept
one    2000    Ohio  1.5     0   NaN
two    2001    Ohio  1.7     1  -1.2
three  2002    Ohio  3.6     2   NaN
four   2001  Nevada  2.4     3  -1.5
five   2002  Nevada  2.9     4  -1.7

In [56]:
pop = {'Nevada':{2001:2.4,2002:2.9},'Ohio':{2000:1.5,2001:1.7,2002:3.6}}

In [57]:
frame3 = DataFrame(pop)

In [58]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [59]:
frame3.T   #역치

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [60]:
DataFrame(pop,index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [61]:
pdata={'Ohio':frame3['Ohio'][:-1],'Nevada':frame3['Nevada'][:2]}

In [62]:
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [63]:
pdata

{'Nevada': 2000    NaN
 2001    2.4
 Name: Nevada, dtype: float64, 'Ohio': 2000    1.5
 2001    1.7
 Name: Ohio, dtype: float64}

In [64]:
frame3.index.name='year';frame3.columns.name='state'

In [65]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [66]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [67]:
frame2.values

array([[2000L, 'Ohio', 1.5, 0.0, nan],
       [2001L, 'Ohio', 1.7, 1.0, -1.2],
       [2002L, 'Ohio', 3.6, 2.0, nan],
       [2001L, 'Nevada', 2.4, 3.0, -1.5],
       [2002L, 'Nevada', 2.9, 4.0, -1.7]], dtype=object)

### 5.1.3 색인 객체

In [68]:
obj = Series(range(3),index=['a','b','c'])

In [69]:
index = obj.index

In [70]:
index

Index([u'a', u'b', u'c'], dtype='object')

In [71]:
index[1:]

Index([u'b', u'c'], dtype='object')

In [72]:
index[1] = 'd'
#TypeError: Indexes does not support mutable operations

TypeError: Indexes does not support mutable operations

In [73]:
index = pd.Index(np.arange(3))

In [74]:
index

Int64Index([0, 1, 2], dtype='int64')

In [75]:
obj2 = Series([1.5, -2.5, 0], index=index)

In [76]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [77]:
obj2.index is index

True

In [78]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [79]:
'Ohio' in frame3

True

In [80]:
2000 in frame3  #column에 존재하는지

False

In [81]:
2000 in frame3.index  #index에 존재하는지

True

In [82]:
2003 in frame3.index

False

## 핵심기능

### 5.2.1 재색인

In [83]:
obj = Series([4.5, 7.2, -5.3, 3.6],index=['d','b','a','c'])

In [84]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [85]:
obj2 = obj.reindex(['a','b','c','d','e'])   #reindex 색인다시설정

In [86]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [87]:
obj.reindex(['a','b','c','d','e'],fill_value=0) #NaN을 0으로

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [88]:
obj3 = Series(['blue','purple','yellow'],index=[0,2,4])

In [89]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [90]:
obj3.reindex(range(6),method="ffill")
#range(6)까지 index를 앞의 값으로 채워준다

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [91]:
obj3 = Series(['blue','purple','yellow'],index=[0,2,4])

In [92]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [93]:
obj3.reindex(range(6),method="bfill")
# 뒤의 값으로 채워준다

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [94]:
frame = DataFrame(np.arange(9).reshape((3,3)),index=['a','c','d'],
                  columns=['Ohio','Texas','California'])

In [95]:
frame = DataFrame(np.arange(9).reshape(3,3),index=['a','c','d'],
                  columns=['Ohio','Texas','California'])

In [96]:
frame.shape

(3, 3)

In [97]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [98]:
frame2 = frame.reindex(['a','b','c','d'])

In [99]:
frame2

   Ohio  Texas  California
a     0      1           2
b   NaN    NaN         NaN
c     3      4           5
d     6      7           8

In [100]:
states = ['Texas', 'Utah', 'California']

In [101]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [102]:
frame.reindex(index=['a','b','c','d'],method='ffill',columns=states)

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [103]:
frame.ix[['a','b','c','d'],states]

   Texas  Utah  California
a      1   NaN           2
b    NaN   NaN         NaN
c      4   NaN           5
d      7   NaN           8

### 5.2.2 하나의 로우 또는 칼럼 삭제하기

In [104]:
obj = Series(np.arange(5.),index=['a','b','c','d','e'])

In [105]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: float64

In [106]:
new_obj = obj.drop('c')  #c 를 drop한다

In [107]:
new_obj

a    0
b    1
d    3
e    4
dtype: float64

In [108]:
obj.drop(['d','c'])

a    0
b    1
e    4
dtype: float64

In [109]:
data = DataFrame(np.arange(16).reshape(4,4),index = ['Ohio','Colorado','Utah','New York'],
                 columns=['one','two','three','four'])

In [110]:
data.drop(['Colorado','Utah'])

          one  two  three  four
Ohio        0    1      2     3
New York   12   13     14    15

In [111]:
data.drop('two',axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [112]:
data.drop(['two','four'],axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [113]:
data.drop(['Ohio','Utah'],axis=0)

          one  two  three  four
Colorado    4    5      6     7
New York   12   13     14    15

### 5.2.3 색인하기, 선택하기, 거르기

In [114]:
obj = Series(np.arange(4.),index=['a','b','c','d'])

In [115]:
obj

a    0
b    1
c    2
d    3
dtype: float64

In [116]:
obj['b']

1.0

In [117]:
obj[1]

1.0

In [118]:
obj[2:4]

c    2
d    3
dtype: float64

In [119]:
obj[['b', 'a', 'd']]

b    1
a    0
d    3
dtype: float64

In [120]:
obj[[1, 3]]

b    1
d    3
dtype: float64

In [121]:
obj[obj < 2]

a    0
b    1
dtype: float64

In [122]:
obj['b':'c']

b    1
c    2
dtype: float64

In [123]:
obj[1:3]

b    1
c    2
dtype: float64

In [124]:
obj['b':'c'] = 5
obj

a    0
b    5
c    5
d    3
dtype: float64

In [125]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

In [126]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [127]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [128]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [129]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [130]:
data['three'] > 5

Ohio        False
Colorado     True
Utah         True
New York     True
Name: three, dtype: bool

In [131]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [132]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [133]:
data[data < 5] = 0

In [134]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [135]:
data.ix['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [136]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [137]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [138]:
data.ix[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [139]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### Arithmetic and data alignment

In [140]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [142]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [143]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [144]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [146]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'), index=['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [147]:
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [148]:
df1 + df2

           b   c   d   e
Colorado NaN NaN NaN NaN
Ohio       3 NaN   6 NaN
Oregon   NaN NaN NaN NaN
Texas      9 NaN  12 NaN
Utah     NaN NaN NaN NaN

In [149]:
df1.add(df2, fill_value=0)

          b   c   d   e
Colorado  6   7   8 NaN
Ohio      3   1   6   5
Oregon    9 NaN  10  11
Texas     9   4  12   8
Utah      0 NaN   1   2

In [150]:
df1.reindex(columns=df2.columns, fill_value=0)

          b  d  e
Ohio      0  2  0
Texas     3  5  0
Colorado  6  8  0

### Operations between DataFrame and Series

In [151]:
arr = np.arange(12.).reshape((3, 4))

In [152]:
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [153]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [154]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [155]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.ix[0]

In [156]:
series

b    0
d    1
e    2
Name: Utah, dtype: float64

In [157]:
frame - series

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

In [158]:
series2 = Series(range(3), index=['b', 'e', 'f'])

In [159]:

frame + series2

        b   d   e   f
Utah    0 NaN   3 NaN
Ohio    3 NaN   6 NaN
Texas   6 NaN   9 NaN
Oregon  9 NaN  12 NaN

In [160]:
series3 = frame['d']

In [161]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [165]:
series3

Utah       1
Ohio       4
Texas      7
Oregon    10
Name: d, dtype: float64

In [166]:
frame.sub(series3, axis=0)

        b  d  e
Utah   -1  0  1
Ohio   -1  0  1
Texas  -1  0  1
Oregon -1  0  1

### Function application and mapping

In [167]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [168]:
frame

               b         d         e
Utah    0.930056 -1.029728 -0.505812
Ohio    0.883601  0.093903 -0.611977
Texas   1.490701 -0.911092  0.364081
Oregon  0.371572 -0.649636  0.944995

In [169]:
np.abs(frame)

               b         d         e
Utah    0.930056  1.029728  0.505812
Ohio    0.883601  0.093903  0.611977
Texas   1.490701  0.911092  0.364081
Oregon  0.371572  0.649636  0.944995

In [170]:
f = lambda x: x.max() - x.min()

In [171]:
frame.apply(f)

b    1.119130
d    1.123631
e    1.556972
dtype: float64

In [172]:
frame.apply(f, axis=1)

Utah      1.959784
Ohio      1.495578
Texas     2.401794
Oregon    1.594631
dtype: float64

In [173]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e
min  0.371572 -1.029728 -0.611977
max  1.490701  0.093903  0.944995

In [174]:
format = lambda x: '%.2f' % x
frame.applymap(format)

           b      d      e
Utah    0.93  -1.03  -0.51
Ohio    0.88   0.09  -0.61
Texas   1.49  -0.91   0.36
Oregon  0.37  -0.65   0.94

In [175]:
frame['e'].map(format)

Utah      -0.51
Ohio      -0.61
Texas      0.36
Oregon     0.94
Name: e, dtype: object

### Sorting and ranking

In [176]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])

In [177]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [178]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'], columns=['d', 'a', 'b', 'c'])

In [179]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [180]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [181]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [182]:
frame.sort_index(axis=1, ascending=True)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [184]:
frame.sort_index(axis=0)

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [185]:
obj = Series([4, 7, -3, 2])
obj.order()

2   -3
3    2
0    4
1    7
dtype: int64

In [186]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])
obj.order()

4    -3
5     2
0     4
2     7
1   NaN
3   NaN
dtype: float64

In [187]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [188]:
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [189]:
frame.sort_index(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [190]:
frame.sort_index(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [191]:
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [192]:
obj.rank(method='first')

0    6
1    1
2    7
3    4
4    3
5    2
6    5
dtype: float64

In [193]:
obj.rank(ascending=False, method='max')

0    2
1    7
2    2
3    4
4    5
5    6
6    4
dtype: float64

In [194]:
obj.rank(ascending=False, method='min')

0    1
1    7
2    1
3    3
4    5
5    6
6    3
dtype: float64

In [195]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1], 'c': [-2, 5, 8, -2.5]})

In [196]:
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [197]:
frame.rank(axis=1)

   a  b  c
0  2  3  1
1  1  3  2
2  2  1  3
3  2  3  1

### Axis indexes with duplicate values

In [198]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [199]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [200]:
obj.index.is_unique

False

In [201]:
obj['a']

a    0
a    1
dtype: int64

In [202]:
obj['c']

4

In [203]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [204]:
df

          0         1         2
a  0.060060  0.608902 -0.635678
a -0.569468 -0.858270 -0.994627
b -0.336294  1.046670 -0.879393
b  1.659724  0.267278  0.946129

In [205]:
df.ix['b']

          0         1         2
b -0.336294  1.046670 -0.879393
b  1.659724  0.267278  0.946129

### Summarizing and computing descriptive statistics

In [206]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]],
               index=['a', 'b', 'c', 'd'], columns=['one', 'two'])

In [207]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [208]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [209]:
df.sum(axis=1)

a    1.40
b    2.60
c     NaN
d   -0.55
dtype: float64

In [210]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [211]:
df.idxmax()

one    b
two    d
dtype: object

In [212]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [213]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [214]:
obj = Series(['a', 'a', 'b', 'c'] * 4)

In [215]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Correlation and covariance

In [216]:
import pandas.io.data as web

In [217]:
all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker)

In [218]:
price = DataFrame({tic: data['Adj Close'] for tic, data in all_data.iteritems()})

In [219]:
price

                  AAPL        GOOG         IBM       MSFT
Date
2010-01-04   28.718094         NaN  118.634733  26.769336
2010-01-05   28.767737         NaN  117.201630  26.777984
2010-01-06   28.310151         NaN  116.440284  26.613650
2010-01-07   28.257821         NaN  116.037224  26.336875
2010-01-08   28.445687         NaN  117.201630  26.518508
2010-01-11   28.194745         NaN  115.974519  26.181189
2010-01-12   27.874037         NaN  116.897084  26.008204
2010-01-13   28.267213         NaN  116.646290  26.250383
2010-01-14   28.103497         NaN  118.509336  26.777984
2010-01-15   27.633830         NaN  118.034619  26.691493
2010-01-19   28.856306         NaN  120.148459  26.899074
2010-01-20   28.412135         NaN  116.664208  26.457964
2010-01-21   27.921004         NaN  115.544590  25.956309
2010-01-22   26.536154         NaN  112.409659  25.048140
2010-01-25   27.250048         NaN  112.964992  25.359512
2010-01-26   27.635174         NaN  112.633583  25.515199
2010-01-27   27.895500         NaN  113.153087  25.662235
2010-01-28   26.742807         NaN  110.842194  25.221125
2010-01-29   25.772608         NaN  109.624049  24.373502
2010-02-01   26.130897         NaN  111.666231  24.572434
2010-02-02   26.282534         NaN  112.436529  24.615679
2010-02-03   26.734757         NaN  112.552973  24.762716
2010-02-04   25.771266         NaN  110.170423  24.079428
2010-02-05   26.228860         NaN  110.636181  24.235114
2010-02-08   26.049045         NaN  109.655504  23.975637
2010-02-09   26.326814         NaN  110.852108  24.226465
2010-02-10   26.183238         NaN  110.492226  24.209166
2010-02-11   26.659611         NaN  111.319956  24.321607
2010-02-12   26.889071         NaN  111.562872  24.157271
2010-02-16   27.294328         NaN  112.669507  24.635203
...                ...         ...         ...        ...
2015-06-16  127.599998  528.150024  166.839996  45.830002
2015-06-17  127.300003  529.260010  167.169998  45.970001
2015-06-18  127.879997  536.729980  168.250000  46.720001
2015-06-19  126.599998  536.690002  166.990005  46.099998
2015-06-22  127.610001  538.190002  167.729996  46.230000
2015-06-23  127.029999  540.479980  168.619995  45.910000
2015-06-24  128.110001  537.840027  166.970001  45.639999
2015-06-25  127.500000  535.229980  166.080002  45.650002
2015-06-26  126.750000  531.690002  165.460007  45.259998
2015-06-29  124.529999  521.520020  162.970001  44.369999
2015-06-30  125.430000  520.510010  162.660004  44.150002
2015-07-01  126.599998  521.840027  164.490005  44.450001
2015-07-02  126.440002  523.400024  165.089996  44.400002
2015-07-06  126.000000  522.859985  164.729996  44.389999
2015-07-07  125.690002  525.020020  165.000000  44.299999
2015-07-08  122.570000  516.830017  163.160004  44.240002
2015-07-09  120.070000  520.679993  163.850006  44.520000
2015-07-10  123.279999  530.130005  166.949997  44.610001
2015-07-13  125.660004  546.549988  169.380005  45.540001
2015-07-14  125.610001  561.099976  168.610001  45.619999
2015-07-15  126.820000  560.219971  168.529999  45.759998
2015-07-16  128.509995  579.849976  171.000000  46.660000
2015-07-17  129.619995  672.929993  172.509995  46.619999
2015-07-20  132.070007  663.020020  173.220001  46.919998
2015-07-21  130.750000  662.299988  163.070007  47.279999
2015-07-22  125.220001  662.099976  160.350006  45.540001
2015-07-23  125.160004  644.280029  161.729996  46.110001
2015-07-24  124.500000  623.559998  159.750000  45.939999
2015-07-27  122.769997  627.260010  159.070007  45.349998
2015-07-28  123.379997  628.000000  160.050003  45.340000

[1401 rows x 4 columns]

In [220]:
volume = DataFrame({tic: data['Volume'] for tic, data in all_data.iteritems()})

In [221]:
volume

                 AAPL      GOOG       IBM       MSFT
Date
2010-01-04  123432400       NaN   6155300   38409100
2010-01-05  150476200       NaN   6841400   49749600
2010-01-06  138040000       NaN   5605300   58182400
2010-01-07  119282800       NaN   5840600   50559700
2010-01-08  111902700       NaN   4197200   51197400
2010-01-11  115557400       NaN   5730400   68754700
2010-01-12  148614900       NaN   8081500   65912100
2010-01-13  151473000       NaN   6455400   51863500
2010-01-14  108223500       NaN   7111800   63228100
2010-01-15  148516900       NaN   8494400   79913200
2010-01-19  182501900       NaN  13916200   46575700
2010-01-20  153038200       NaN  15197500   54849500
2010-01-21  152038600       NaN   9608600   73086700
2010-01-22  220441900       NaN  10088600  102004600
2010-01-25  266424900       NaN   5738500   63373000
2010-01-26  466777500       NaN   7135300   66639900
2010-01-27  430642100       NaN   8719200   63949500
2010-01-28  293375600       NaN   9622200  117513700
2010-01-29  311488100       NaN  11571200  193888500
2010-02-01  187469100       NaN   7242900   85931100
2010-02-02  174585600       NaN   5899900   54413700
2010-02-03  153832000       NaN   4177100   61397900
2010-02-04  189413000       NaN   9126900   77850000
2010-02-05  212576700       NaN   8617000   80960100
2010-02-08  119567700       NaN   5718500   52820600
2010-02-09  158221700       NaN   6044500   59195800
2010-02-10   92590400       NaN   5219100   48591300
2010-02-11  137586400       NaN   5089000   65993700
2010-02-12  163867200       NaN   8017700   81117200
2010-02-16  135934400       NaN   6777300   51935600
...               ...       ...       ...        ...
2015-06-16   31494100   1071800   3249800   26822500
2015-06-17   32918100   1294200   2863000   28566300
2015-06-18   35407200   1833100   3330900   32184500
2015-06-19   54716900   1893500   7074000   57500600
2015-06-22   34039300   1250300   2335800   20278600
2015-06-23   30268900   1197500   3701600   25787000
2015-06-24   55280900   1286600   3548100   34784600
2015-06-25   31938100   1335700   2408900   20569500
2015-06-26   44066800   2109100   8946000   45610900
2015-06-29   48911400   1930900   3296800   33899600
2015-06-30   43849800   2217200   3594800   35214100
2015-07-01   30128600   1961000   3126600   28337200
2015-07-02   27122500   1234000   2836600   21713000
2015-07-06   27900200   1276500   3003200   22969700
2015-07-07   46716100   1595700   3474400   36418200
2015-07-08   60490200   1264600   2768300   39686300
2015-07-09   77821600   1839400   4138500   32099800
2015-07-10   61194200   1859900   4533300   25365300
2015-07-13   37237800   2199800   4225500   24994700
2015-07-14   31535500   3225100   2974900   22723700
2015-07-15   33463100   1776600   1995700   26482000
2015-07-16   35866800   4053900   3523700   25894400
2015-07-17   45693300  11134500   4305200   29262900
2015-07-20   54159800   5848800   6476900   30271200
2015-07-21   58898800   3348400  13686500   41205000
2015-07-22  114692800   3689600   7167100   58724600
2015-07-23   50688700   3001800   5003500   33465600
2015-07-24   41051600   3608400   3566300   32077000
2015-07-27   44274800   2668700   3695800   39189900
2015-07-28   33448900   1704300   2608300   34177100

[1401 rows x 4 columns]

In [222]:
returns = price.pct_change()

In [223]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2015-07-22 -0.042294 -0.000302 -0.016680 -0.036802
2015-07-23 -0.000479 -0.026914  0.008606  0.012516
2015-07-24 -0.005273 -0.032160 -0.012243 -0.003687
2015-07-27 -0.013896  0.005934 -0.004257 -0.012843
2015-07-28  0.004969  0.001180  0.006161 -0.000220

In [224]:
returns.MSFT.corr(returns.IBM)

0.49518262675257968

In [225]:
returns.MSFT.cov(returns.IBM)

8.3240782420226586e-05

In [226]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.277287  0.381394  0.351797
GOOG  0.277287  1.000000  0.319138  0.375100
IBM   0.381394  0.319138  1.000000  0.495183
MSFT  0.351797  0.375100  0.495183  1.000000

In [227]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000275  0.000061  0.000074  0.000083
GOOG  0.000061  0.000252  0.000058  0.000084
IBM   0.000074  0.000058  0.000138  0.000083
MSFT  0.000083  0.000084  0.000083  0.000204

In [228]:
returns.corrwith(returns.IBM)

AAPL    0.381394
GOOG    0.319138
IBM     1.000000
MSFT    0.495183
dtype: float64

In [229]:
returns.corrwith(volume)

AAPL   -0.092666
GOOG    0.226701
IBM    -0.183754
MSFT   -0.097645
dtype: float64

### Unique values, value counts, and membership

In [230]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [231]:
uniques = obj.unique()

In [232]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [233]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [234]:
pd.value_counts(obj.values, sort=False)

a    3
c    3
b    2
d    1
dtype: int64

In [236]:
pd.value_counts(obj.values, sort=True)

c    3
a    3
b    2
d    1
dtype: int64

In [237]:
mask = obj.isin(['b', 'c'])

In [238]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [239]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [240]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4], 'Qu2': [2, 3, 1, 2, 3], 'Qu3': [1, 5, 2, 4, 4]})

In [241]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [242]:
result = data.apply(pd.value_counts).fillna(0)

In [243]:
result

   Qu1  Qu2  Qu3
1    1    1    1
2    0    2    1
3    2    2    0
4    2    0    2
5    0    0    1

### Handling missing data

In [244]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [245]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [246]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [247]:
string_data[0] = None

In [248]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering out missing data

In [249]:
from numpy import nan as NA

In [250]:
data = Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [251]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [252]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])

In [253]:
cleaned = data.dropna()

In [254]:
data

    0    1   2
0   1  6.5   3
1   1  NaN NaN
2 NaN  NaN NaN
3 NaN  6.5   3

In [255]:
cleaned

   0    1  2
0  1  6.5  3

In [256]:
data.dropna(how='all')

    0    1   2
0   1  6.5   3
1   1  NaN NaN
3 NaN  6.5   3

In [257]:
data[4] = NA

In [258]:
data

    0    1   2   4
0   1  6.5   3 NaN
1   1  NaN NaN NaN
2 NaN  NaN NaN NaN
3 NaN  6.5   3 NaN

In [259]:
data.dropna(axis=1, how='all')

    0    1   2
0   1  6.5   3
1   1  NaN NaN
2 NaN  NaN NaN
3 NaN  6.5   3

In [260]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [261]:
df = DataFrame(np.random.randn(7, 3))

In [262]:
df.ix[:4, 1] = NA; df.ix[:2, 2] = NA

In [263]:
df

          0         1         2
0  0.649612       NaN       NaN
1 -2.444276       NaN       NaN
2 -0.411303       NaN       NaN
3  0.052783       NaN -0.431216
4 -0.466507       NaN  0.236962
5 -1.459988  0.189685  0.741065
6 -2.295352  1.012580 -1.170993

In [264]:
df.dropna(thresh=3)

          0         1         2
5 -1.459988  0.189685  0.741065
6 -2.295352  1.012580 -1.170993

### Filling in missing data

In [265]:
df.fillna(0)

          0         1         2
0  0.649612  0.000000  0.000000
1 -2.444276  0.000000  0.000000
2 -0.411303  0.000000  0.000000
3  0.052783  0.000000 -0.431216
4 -0.466507  0.000000  0.236962
5 -1.459988  0.189685  0.741065
6 -2.295352  1.012580 -1.170993

In [266]:
df.fillna({1: 0.5, 3: -1})

          0         1         2
0  0.649612  0.500000       NaN
1 -2.444276  0.500000       NaN
2 -0.411303  0.500000       NaN
3  0.052783  0.500000 -0.431216
4 -0.466507  0.500000  0.236962
5 -1.459988  0.189685  0.741065
6 -2.295352  1.012580 -1.170993

In [267]:
_ = df.fillna(0, inplace=True)

In [268]:
df

          0         1         2
0  0.649612  0.000000  0.000000
1 -2.444276  0.000000  0.000000
2 -0.411303  0.000000  0.000000
3  0.052783  0.000000 -0.431216
4 -0.466507  0.000000  0.236962
5 -1.459988  0.189685  0.741065
6 -2.295352  1.012580 -1.170993

In [269]:
df = DataFrame(np.random.randn(6, 3))

In [270]:
df.ix[2:, 1] = NA; df.ix[4:, 2] = NA

In [271]:
df

          0         1         2
0 -2.038867 -0.783150  0.829675
1 -0.247572  1.331253 -1.684199
2  1.581143       NaN  0.192681
3  0.072564       NaN -0.669811
4 -1.102001       NaN       NaN
5 -0.283220       NaN       NaN

In [272]:
df.fillna(method='ffill')

          0         1         2
0 -2.038867 -0.783150  0.829675
1 -0.247572  1.331253 -1.684199
2  1.581143  1.331253  0.192681
3  0.072564  1.331253 -0.669811
4 -1.102001  1.331253 -0.669811
5 -0.283220  1.331253 -0.669811

In [273]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -2.038867 -0.783150  0.829675
1 -0.247572  1.331253 -1.684199
2  1.581143  1.331253  0.192681
3  0.072564  1.331253 -0.669811
4 -1.102001       NaN -0.669811
5 -0.283220       NaN -0.669811

In [274]:
data = Series([1., NA, 3.5, NA, 7])

In [275]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

### Hierarchical indexing

In [276]:
data = Series(np.random.randn(10), index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'], [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])

In [277]:
data

a  1   -1.216459
   2   -0.712126
   3   -1.260554
b  1   -0.712818
   2   -1.070935
   3    1.221265
c  1   -0.151828
   2   -0.612057
d  2   -0.175843
   3   -0.141224
dtype: float64

In [278]:
data.index

MultiIndex(levels=[[u'a', u'b', u'c', u'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [279]:
data['b']

1   -0.712818
2   -1.070935
3    1.221265
dtype: float64

In [280]:
data['b':'c']

b  1   -0.712818
   2   -1.070935
   3    1.221265
c  1   -0.151828
   2   -0.612057
dtype: float64

In [281]:
data.ix[['b', 'd']]

b  1   -0.712818
   2   -1.070935
   3    1.221265
d  2   -0.175843
   3   -0.141224
dtype: float64

In [282]:
data[:, 2]

a   -0.712126
b   -1.070935
c   -0.612057
d   -0.175843
dtype: float64

In [283]:
data.unstack()

          1         2         3
a -1.216459 -0.712126 -1.260554
b -0.712818 -1.070935  1.221265
c -0.151828 -0.612057       NaN
d       NaN -0.175843 -0.141224

In [284]:
data.unstack().stack()

a  1   -1.216459
   2   -0.712126
   3   -1.260554
b  1   -0.712818
   2   -1.070935
   3    1.221265
c  1   -0.151828
   2   -0.612057
d  2   -0.175843
   3   -0.141224
dtype: float64

In [285]:
frame = DataFrame(np.arange(12).reshape((4, 3)),  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']])

In [286]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [288]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

### Reordering and sorting levels

In [289]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [290]:
frame.sortlevel(1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [291]:
frame.sortlevel()

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [292]:
frame.swaplevel(0, 1).sortlevel(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

### Summary statistics by level

In [293]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [294]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### Using a DataFrame's columns

In [295]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1), 'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'], 'd': [0, 1, 2, 0, 1, 2, 3]})

In [296]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [297]:
frame2 = frame.set_index(['c', 'd'])

In [298]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [299]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [300]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

## Other pandas topics

### Integer indexing

In [301]:
ser = Series(np.arange(3.))
ser.iloc[-1]

2.0

In [302]:
ser

0    0
1    1
2    2
dtype: float64

In [303]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

2.0

In [304]:
ser.ix[:1]

0    0
1    1
dtype: float64

In [305]:
ser3 = Series(range(3), index=[-5, 1, 3])
ser3.iloc[2]

2

In [306]:
frame = DataFrame(np.arange(6).reshape((3, 2)), index=[2, 0, 1])
frame.iloc[0]

0    0
1    1
Name: 2, dtype: int32

### Panel data

In [308]:
import pandas.io.data as web

In [310]:
pdata = pd.Panel(dict((stk, web.get_data_yahoo(stk)) for stk in ['AAPL', 'GOOG', 'MSFT', 'DELL']))

In [311]:
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 1421 (major_axis) x 6 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2010-01-04 00:00:00 to 2015-07-28 00:00:00
Minor_axis axis: Open to Adj Close

In [312]:
pdata = pdata.swapaxes('items', 'minor')

In [313]:
pdata['Adj Close']

                  AAPL      DELL        GOOG       MSFT
Date
2010-01-04   28.718094  14.06528         NaN  26.769336
2010-01-05   28.767737  14.38450         NaN  26.777984
2010-01-06   28.310151  14.10397         NaN  26.613650
2010-01-07   28.257821  14.23940         NaN  26.336875
2010-01-08   28.445687  14.36516         NaN  26.518508
2010-01-11   28.194745  14.37483         NaN  26.181189
2010-01-12   27.874037  14.56830         NaN  26.008204
2010-01-13   28.267213  14.57797         NaN  26.250383
2010-01-14   28.103497  14.22005         NaN  26.777984
2010-01-15   27.633830  13.92985         NaN  26.691493
2010-01-19   28.856306  14.32646         NaN  26.899074
2010-01-20   28.412135  14.03626         NaN  26.457964
2010-01-21   27.921004  13.92017         NaN  25.956309
2010-01-22   26.536154  13.18982         NaN  25.048140
2010-01-25   27.250048  13.43650         NaN  25.359512
2010-01-26   27.635174  13.13662         NaN  25.515199
2010-01-27   27.895500  13.08825         NaN  25.662235
2010-01-28   26.742807  12.84641         NaN  25.221125
2010-01-29   25.772608  12.47882         NaN  24.373502
2010-02-01   26.130897  12.78837         NaN  24.572434
2010-02-02   26.282534  12.86576         NaN  24.615679
2010-02-03   26.734757  12.92380         NaN  24.762716
2010-02-04   25.771266  12.58523         NaN  24.079428
2010-02-05   26.228860  12.80772         NaN  24.235114
2010-02-08   26.049045  12.95282         NaN  23.975637
2010-02-09   26.326814  13.10760         NaN  24.226465
2010-02-10   26.183238  13.30107         NaN  24.209166
2010-02-11   26.659611  13.49454         NaN  24.321607
2010-02-12   26.889071  13.38813         NaN  24.157271
2010-02-16   27.294328  13.67834         NaN  24.635203
...                ...       ...         ...        ...
2015-06-16  127.599998       NaN  528.150024  45.830002
2015-06-17  127.300003       NaN  529.260010  45.970001
2015-06-18  127.879997       NaN  536.729980  46.720001
2015-06-19  126.599998       NaN  536.690002  46.099998
2015-06-22  127.610001       NaN  538.190002  46.230000
2015-06-23  127.029999       NaN  540.479980  45.910000
2015-06-24  128.110001       NaN  537.840027  45.639999
2015-06-25  127.500000       NaN  535.229980  45.650002
2015-06-26  126.750000       NaN  531.690002  45.259998
2015-06-29  124.529999       NaN  521.520020  44.369999
2015-06-30  125.430000       NaN  520.510010  44.150002
2015-07-01  126.599998       NaN  521.840027  44.450001
2015-07-02  126.440002       NaN  523.400024  44.400002
2015-07-06  126.000000       NaN  522.859985  44.389999
2015-07-07  125.690002       NaN  525.020020  44.299999
2015-07-08  122.570000       NaN  516.830017  44.240002
2015-07-09  120.070000       NaN  520.679993  44.520000
2015-07-10  123.279999       NaN  530.130005  44.610001
2015-07-13  125.660004       NaN  546.549988  45.540001
2015-07-14  125.610001       NaN  561.099976  45.619999
2015-07-15  126.820000       NaN  560.219971  45.759998
2015-07-16  128.509995       NaN  579.849976  46.660000
2015-07-17  129.619995       NaN  672.929993  46.619999
2015-07-20  132.070007       NaN  663.020020  46.919998
2015-07-21  130.750000       NaN  662.299988  47.279999
2015-07-22  125.220001       NaN  662.099976  45.540001
2015-07-23  125.160004       NaN  644.280029  46.110001
2015-07-24  124.500000       NaN  623.559998  45.939999
2015-07-27  122.769997       NaN  627.260010  45.349998
2015-07-28  123.379997       NaN  628.000000  45.340000

[1421 rows x 4 columns]

In [314]:
pdata.ix[:, '6/1/2012', :]

            Open        High         Low       Close     Volume  Adj Close
AAPL  569.159996  572.649956  560.520012  560.990036  130246900  75.279486
DELL   12.150000   12.300000   12.045000   12.070000   19397600  11.675920
GOOG         NaN         NaN         NaN         NaN        NaN        NaN
MSFT   28.760000   28.959999   28.440001   28.450001   56634300  26.126961

In [315]:
pdata.ix['Adj Close', '5/22/2012':, :]

                  AAPL      DELL        GOOG       MSFT
Date
2012-05-22   74.740031  14.58765         NaN  27.329995
2012-05-23   76.563680  12.08221         NaN  26.733070
2012-05-24   75.860527  12.04351         NaN  26.696335
2012-05-25   75.453926  12.05319         NaN  26.687151
2012-05-28         NaN  12.05319         NaN        NaN
2012-05-29   76.793152  12.24666         NaN  27.146325
2012-05-30   77.719062  12.14992         NaN  26.944289
2012-05-31   77.525831  11.92743         NaN  26.806537
2012-06-01   75.279486  11.67592         NaN  26.126961
2012-06-04   75.722313  11.60821         NaN  26.218794
2012-06-05   75.526394  11.76298         NaN  26.182061
2012-06-06   76.684450  11.81619         NaN  26.953473
2012-06-07   76.719351  11.73396         NaN  26.843270
2012-06-08   77.873386  11.72429         NaN  27.228976
2012-06-11   76.645536  11.47278         NaN  26.540216
2012-06-12   77.315149  11.57919         NaN  26.898372
2012-06-13   76.778382  11.87423         NaN  26.751435
2012-06-14   76.693845  11.93711         NaN  26.944289
2012-06-15   77.042741  11.89841         NaN  27.568765
2012-06-18   78.606065  12.01449         NaN  27.403462
2012-06-19   78.824788  11.78233         NaN  28.193241
2012-06-20   78.600690  11.89841         NaN  28.404460
2012-06-21   77.517783  11.60821         NaN  27.678965
2012-06-22   78.112240  11.80168         NaN  28.193241
2012-06-25   76.591858  11.55500         NaN  27.431013
2012-06-26   76.760939  11.53565         NaN  27.568765
2012-06-27   77.092391  11.92743         NaN  27.706517
2012-06-28   76.361060  11.55984         NaN  27.467746
2012-06-29   78.367204  12.10155         NaN  28.092222
2012-07-02   79.510504  11.98064         NaN  28.064671
...                ...       ...         ...        ...
2015-06-16  127.599998       NaN  528.150024  45.830002
2015-06-17  127.300003       NaN  529.260010  45.970001
2015-06-18  127.879997       NaN  536.729980  46.720001
2015-06-19  126.599998       NaN  536.690002  46.099998
2015-06-22  127.610001       NaN  538.190002  46.230000
2015-06-23  127.029999       NaN  540.479980  45.910000
2015-06-24  128.110001       NaN  537.840027  45.639999
2015-06-25  127.500000       NaN  535.229980  45.650002
2015-06-26  126.750000       NaN  531.690002  45.259998
2015-06-29  124.529999       NaN  521.520020  44.369999
2015-06-30  125.430000       NaN  520.510010  44.150002
2015-07-01  126.599998       NaN  521.840027  44.450001
2015-07-02  126.440002       NaN  523.400024  44.400002
2015-07-06  126.000000       NaN  522.859985  44.389999
2015-07-07  125.690002       NaN  525.020020  44.299999
2015-07-08  122.570000       NaN  516.830017  44.240002
2015-07-09  120.070000       NaN  520.679993  44.520000
2015-07-10  123.279999       NaN  530.130005  44.610001
2015-07-13  125.660004       NaN  546.549988  45.540001
2015-07-14  125.610001       NaN  561.099976  45.619999
2015-07-15  126.820000       NaN  560.219971  45.759998
2015-07-16  128.509995       NaN  579.849976  46.660000
2015-07-17  129.619995       NaN  672.929993  46.619999
2015-07-20  132.070007       NaN  663.020020  46.919998
2015-07-21  130.750000       NaN  662.299988  47.279999
2015-07-22  125.220001       NaN  662.099976  45.540001
2015-07-23  125.160004       NaN  644.280029  46.110001
2015-07-24  124.500000       NaN  623.559998  45.939999
2015-07-27  122.769997       NaN  627.260010  45.349998
2015-07-28  123.379997       NaN  628.000000  45.340000

[814 rows x 4 columns]

In [316]:
stacked = pdata.ix[:, '5/30/2012':, :].to_frame()

In [318]:
stacked

                        Open        High         Low       Close     Volume  \
Date       minor
2012-05-30 AAPL   569.200050  579.989990  566.559990  579.169998  132357400
           DELL    12.590000   12.700000   12.460000   12.560000   19787800
           MSFT    29.350000   29.480000   29.120001   29.340000   41585500
2012-05-31 AAPL   580.740021  581.499985  571.459969  577.730019  122918600
           DELL    12.530000   12.540000   12.330000   12.330000   19955600
           MSFT    29.299999   29.420000   28.940001   29.190001   39134000
2012-06-01 AAPL   569.159996  572.649956  560.520012  560.990036  130246900
           DELL    12.150000   12.300000   12.045000   12.070000   19397600
           MSFT    28.760000   28.959999   28.440001   28.450001   56634300
2012-06-04 AAPL   561.500008  567.499985  548.499977  564.290031  139248900
           DELL    12.110000   12.112500   11.800000   12.000000   17015700
           MSFT    28.620001   28.780001   28.320000   28.549999   47926300
2012-06-05 AAPL   561.269989  566.470055  558.330002  562.830025   97053600
           DELL    11.950000   12.240000   11.950000   12.160000   15620900
           MSFT    28.510000   28.750000   28.389999   28.510000   45715400
2012-06-06 AAPL   567.770004  573.849983  565.499992  571.459969  100363900
           DELL    12.210000   12.280000   12.090000   12.215000   20779900
           MSFT    28.879999   29.370001   28.809999   29.350000   46860500
2012-06-07 AAPL   577.290009  577.320023  570.500000  571.720055   94941700
           DELL    12.320000   12.410000   12.120000   12.130000   20074000
           MSFT    29.639999   29.700001   29.170000   29.230000   37792800
2012-06-08 AAPL   571.599998  580.580017  568.999992  580.320038   86879100
           DELL    12.130000   12.225000   12.020000   12.120000   18155600
           MSFT    29.209999   29.680000   29.049999   29.650000   42551100
2012-06-11 AAPL   587.719994  588.499985  570.629990  571.169975  147816200
           DELL    12.150000   12.200000   11.820000   11.860000   16931900
           MSFT    29.730000   29.809999   28.820000   28.900000   46361900
2012-06-12 AAPL   574.459984  576.620033  566.699966  576.159996  108845100
           DELL    11.910000   12.010000   11.680000   11.970000   17608100
           MSFT    29.100000   29.299999   28.840000   29.290001   35337900
...                      ...         ...         ...         ...        ...
2015-07-15 AAPL   125.720001  127.150002  125.580002  126.820000   33463100
           GOOG   560.130005  566.502991  556.789978  560.219971    1776600
           MSFT    45.680000   45.889999   45.430000   45.759998   26482000
2015-07-16 AAPL   127.739998  128.570007  127.349998  128.509995   35866800
           GOOG   565.119995  580.679993  565.000000  579.849976    4053900
           MSFT    46.009998   46.689999   45.970001   46.660000   25894400
2015-07-17 AAPL   129.080002  129.619995  128.309998  129.619995   45693300
           GOOG   649.000000  674.468018  645.000000  672.929993   11134500
           MSFT    46.549999   46.779999   46.259998   46.619999   29262900
2015-07-20 AAPL   130.970001  132.970001  130.699997  132.070007   54159800
           GOOG   659.239990  668.880005  653.010010  663.020020    5848800
           MSFT    46.650002   47.130001   46.439999   46.919998   30271200
2015-07-21 AAPL   132.850006  132.919998  130.320007  130.750000   58898800
           GOOG   655.210022  673.000000  654.299988  662.299988    3348400
           MSFT    46.779999   47.330002   46.480000   47.279999   41205000
2015-07-22 AAPL   121.989998  125.500000  121.989998  125.220001  114692800
           GOOG   660.890015  678.640015  659.000000  662.099976    3689600
           MSFT    45.439999   46.930000   45.200001   45.540001   58724600
2015-07-23 AAPL   126.199997  127.089996  125.059998  125.160004   50688700
           GOOG   661.270020  663.630005  641.000000  644.280029    3001800
           MSFT    45.270000   46.230000   45.099998   46.110001   33465600
2015-07-24 AAPL   125.320000  125.739998  123.900002  124.500000   41051600
           GOOG   647.000000  648.169983  622.520020  623.559998    3608400
           MSFT    45.910000   46.320000   45.799999   45.939999   32077000
2015-07-27 AAPL   123.089996  123.610001  122.120003  122.769997   44274800
           GOOG   621.000000  634.299988  620.500000  627.260010    2668700
           MSFT    45.939999   46.009998   45.250000   45.349998   39189900
2015-07-28 AAPL   123.379997  123.910004  122.550003  123.379997   33448900
           GOOG   632.830017  632.830017  623.309998  628.000000    1704300
           MSFT    45.580002   45.639999   44.790001   45.340000   34177100

                   Adj Close
Date       minor
2012-05-30 AAPL    77.719062
           DELL    12.149920
           MSFT    26.944289
2012-05-31 AAPL    77.525831
           DELL    11.927430
           MSFT    26.806537
2012-06-01 AAPL    75.279486
           DELL    11.675920
           MSFT    26.126961
2012-06-04 AAPL    75.722313
           DELL    11.608210
           MSFT    26.218794
2012-06-05 AAPL    75.526394
           DELL    11.762980
           MSFT    26.182061
2012-06-06 AAPL    76.684450
           DELL    11.816190
           MSFT    26.953473
2012-06-07 AAPL    76.719351
           DELL    11.733960
           MSFT    26.843270
2012-06-08 AAPL    77.873386
           DELL    11.724290
           MSFT    27.228976
2012-06-11 AAPL    76.645536
           DELL    11.472780
           MSFT    26.540216
2012-06-12 AAPL    77.315149
           DELL    11.579190
           MSFT    26.898372
...                      ...
2015-07-15 AAPL   126.820000
           GOOG   560.219971
           MSFT    45.759998
2015-07-16 AAPL   128.509995
           GOOG   579.849976
           MSFT    46.660000
2015-07-17 AAPL   129.619995
           GOOG   672.929993
           MSFT    46.619999
2015-07-20 AAPL   132.070007
           GOOG   663.020020
           MSFT    46.919998
2015-07-21 AAPL   130.750000
           GOOG   662.299988
           MSFT    47.279999
2015-07-22 AAPL   125.220001
           GOOG   662.099976
           MSFT    45.540001
2015-07-23 AAPL   125.160004
           GOOG   644.280029
           MSFT    46.110001
2015-07-24 AAPL   124.500000
           GOOG   623.559998
           MSFT    45.939999
2015-07-27 AAPL   122.769997
           GOOG   627.260010
           MSFT    45.349998
2015-07-28 AAPL   123.379997
           GOOG   628.000000
           MSFT    45.340000

[2297 rows x 6 columns]

In [319]:
stacked.to_panel()

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 808 (major_axis) x 4 (minor_axis)
Items axis: Open to Adj Close
Major_axis axis: 2012-05-30 00:00:00 to 2015-07-28 00:00:00
Minor_axis axis: AAPL to MSFT